raptrDXP/calculator/calculatorConfigs/src/main/synapse-config/api/calculator.xml

<?xml version="1.0" encoding="UTF-8"?>
<api context="/math" name="calculator" statistics="enable" trace="enable" xmlns="http://ws.apache.org/ns/synapse">
    <resource methods="POST" url-mapping="/Add">
        <inSequence>
            <propertyGroup>
                <property expression="json-eval($.a)" name="a" scope="default" type="STRING"/>
                <property expression="json-eval($.b)" name="b" scope="default" type="STRING"/>
            </propertyGroup>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
                        <soapenv:Header/>
                        <soapenv:Body>
                            <tem:Add>
                                <tem:intA>$1</tem:intA>
                                <tem:intB>$2</tem:intB>
                            </tem:Add>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property('a')"/>
                    <arg evaluator="xml" expression="get-property('b')"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="transport" value="urn:http://tempuri.org/Add"/>
            <call>
                <endpoint>
                    <address format="soap11" uri="http://www.dneonline.com/calculator.asmx">
                        <suspendOnFailure>
                            <initialDuration>-1</initialDuration>
                            <progressionFactor>-1</progressionFactor>
                            <maximumDuration>0</maximumDuration>
                        </suspendOnFailure>
                        <markForSuspension>
                            <retriesBeforeSuspension>0</retriesBeforeSuspension>
                        </markForSuspension>
                    </address>
                </endpoint>
            </call>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <respond/>
        </inSequence>
        <outSequence/>
        <faultSequence/>
    </resource>
    <resource methods="POST" url-mapping="/Subtract">
        <inSequence>
            <propertyGroup>
                <property expression="json-eval($.a)" name="a" scope="default" type="STRING"/>
                <property expression="json-eval($.b)" name="b" scope="default" type="STRING"/>
            </propertyGroup>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
                        <soapenv:Header/>
                        <soapenv:Body>
                            <tem:Subtract>
                                <tem:intA>$1</tem:intA>
                                <tem:intB>$2</tem:intB>
                            </tem:Subtract>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property('a')"/>
                    <arg evaluator="xml" expression="get-property('b')"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="transport" value="urn:http://tempuri.org/Subtract"/>
            <call>
                <endpoint>
                    <address format="soap11" uri="http://www.dneonline.com/calculator.asmx">
                        <suspendOnFailure>
                            <initialDuration>-1</initialDuration>
                            <progressionFactor>-1</progressionFactor>
                            <maximumDuration>0</maximumDuration>
                        </suspendOnFailure>
                        <markForSuspension>
                            <retriesBeforeSuspension>0</retriesBeforeSuspension>
                        </markForSuspension>
                    </address>
                </endpoint>
            </call>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <respond/>
        </inSequence>
        <outSequence/>
        <faultSequence/>
    </resource>
    <resource methods="POST" url-mapping="/Multiply">
        <inSequence>
            <propertyGroup>
                <property expression="json-eval($.a)" name="a" scope="default" type="STRING"/>
                <property expression="json-eval($.b)" name="b" scope="default" type="STRING"/>
            </propertyGroup>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
                        <soapenv:Header/>
                        <soapenv:Body>
                            <tem:Multiply>
                                <tem:intA>$1</tem:intA>
                                <tem:intB>$2</tem:intB>
                            </tem:Multiply>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property('a')"/>
                    <arg evaluator="xml" expression="get-property('b')"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="transport" value="urn:http://tempuri.org/Multiply"/>
            <call>
                <endpoint>
                    <address format="soap11" uri="http://www.dneonline.com/calculator.asmx">
                        <suspendOnFailure>
                            <initialDuration>-1</initialDuration>
                            <progressionFactor>-1</progressionFactor>
                            <maximumDuration>0</maximumDuration>
                        </suspendOnFailure>
                        <markForSuspension>
                            <retriesBeforeSuspension>0</retriesBeforeSuspension>
                        </markForSuspension>
                    </address>
                </endpoint>
            </call>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <respond/>
        </inSequence>
        <outSequence/>
        <faultSequence/>
    </resource>
    <resource methods="POST" url-mapping="/Divide">
        <inSequence>
            <propertyGroup>
                <property expression="json-eval($.a)" name="a" scope="default" type="STRING"/>
                <property expression="json-eval($.b)" name="b" scope="default" type="STRING"/>
            </propertyGroup>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
                        <soapenv:Header/>
                        <soapenv:Body>
                            <tem:Divide>
                                <tem:intA>$1</tem:intA>
                                <tem:intB>$2</tem:intB>
                            </tem:Divide>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property('a')"/>
                    <arg evaluator="xml" expression="get-property('b')"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="transport" value="urn:http://tempuri.org/Divide"/>
            <call>
                <endpoint>
                    <address format="soap11" uri="http://www.dneonline.com/calculator.asmx">
                        <suspendOnFailure>
                            <initialDuration>-1</initialDuration>
                            <progressionFactor>-1</progressionFactor>
                            <maximumDuration>0</maximumDuration>
                        </suspendOnFailure>
                        <markForSuspension>
                            <retriesBeforeSuspension>0</retriesBeforeSuspension>
                        </markForSuspension>
                    </address>
                </endpoint>
            </call>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <respond/>
        </inSequence>
        <outSequence/>
        <faultSequence/>
    </resource>
</api>
